create_clock -period 2.50 ddr_clk
create_clock -period 10 axi_clk

# DDR Constraints
#####################
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi0_aaddr[*]}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi0_aaddr[*]}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi0_aburst[*]}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi0_aburst[*]}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi0_aid[*]}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi0_aid[*]}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi0_alen[*]}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi0_alen[*]}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi0_alock[*]}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi0_alock[*]}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi0_asize[*]}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi0_asize[*]}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi0_atype}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi0_atype}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi0_avalid}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi0_avalid}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi0_bready}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi0_bready}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi0_rready}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi0_rready}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi0_wdata[*]}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi0_wdata[*]}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi0_wid[*]}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi0_wid[*]}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi0_wlast}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi0_wlast}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi0_wstrb[*]}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi0_wstrb[*]}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi0_wvalid}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi0_wvalid}]

set_input_delay -clock axi_clk -max 8.310 [get_ports {ddr0_axi0_aready}]
set_input_delay -clock axi_clk -min 4.155 [get_ports {ddr0_axi0_aready}]
set_input_delay -clock axi_clk -max 8.310 [get_ports {ddr0_axi0_bid[*]}]
set_input_delay -clock axi_clk -min 4.155 [get_ports {ddr0_axi0_bid[*]}]
set_input_delay -clock axi_clk -max 8.310 [get_ports {ddr0_axi0_bvalid}]
set_input_delay -clock axi_clk -min 4.155 [get_ports {ddr0_axi0_bvalid}]
set_input_delay -clock axi_clk -max 8.310 [get_ports {ddr0_axi0_rdata[*]}]
set_input_delay -clock axi_clk -min 4.155 [get_ports {ddr0_axi0_rdata[*]}]
set_input_delay -clock axi_clk -max 8.310 [get_ports {ddr0_axi0_rid[*]}]
set_input_delay -clock axi_clk -min 4.155 [get_ports {ddr0_axi0_rid[*]}]
set_input_delay -clock axi_clk -max 8.310 [get_ports {ddr0_axi0_rlast}]
set_input_delay -clock axi_clk -min 4.155 [get_ports {ddr0_axi0_rlast}]
set_input_delay -clock axi_clk -max 8.310 [get_ports {ddr0_axi0_rresp[*]}]
set_input_delay -clock axi_clk -min 4.155 [get_ports {ddr0_axi0_rresp[*]}]
set_input_delay -clock axi_clk -max 8.310 [get_ports {ddr0_axi0_rvalid}]
set_input_delay -clock axi_clk -min 4.155 [get_ports {ddr0_axi0_rvalid}]
set_input_delay -clock axi_clk -max 8.310 [get_ports {ddr0_axi0_wready}]
set_input_delay -clock axi_clk -min 4.155 [get_ports {ddr0_axi0_wready}]

set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi1_aaddr[*]}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi1_aaddr[*]}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi1_aburst[*]}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi1_aburst[*]}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi1_aid[*]}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi1_aid[*]}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi1_alen[*]}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi1_alen[*]}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi1_alock[*]}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi1_alock[*]}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi1_asize[*]}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi1_asize[*]}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi1_atype}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi1_atype}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi1_avalid}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi1_avalid}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi1_bready}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi1_bready}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi1_rready}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi1_rready}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi1_wdata[*]}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi1_wdata[*]}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi1_wid[*]}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi1_wid[*]}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi1_wlast}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi1_wlast}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi1_wstrb[*]}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi1_wstrb[*]}]
set_output_delay -clock axi_clk -max -2.810 [get_ports {ddr0_axi1_wvalid}]
set_output_delay -clock axi_clk -min -2.155 [get_ports {ddr0_axi1_wvalid}]

set_input_delay -clock axi_clk -max 8.310 [get_ports {ddr0_axi1_aready}]
set_input_delay -clock axi_clk -min 4.155 [get_ports {ddr0_axi1_aready}]
set_input_delay -clock axi_clk -max 8.310 [get_ports {ddr0_axi1_bid[*]}]
set_input_delay -clock axi_clk -min 4.155 [get_ports {ddr0_axi1_bid[*]}]
set_input_delay -clock axi_clk -max 8.310 [get_ports {ddr0_axi1_bvalid}]
set_input_delay -clock axi_clk -min 4.155 [get_ports {ddr0_axi1_bvalid}]
set_input_delay -clock axi_clk -max 8.310 [get_ports {ddr0_axi1_rdata[*]}]
set_input_delay -clock axi_clk -min 4.155 [get_ports {ddr0_axi1_rdata[*]}]
set_input_delay -clock axi_clk -max 8.310 [get_ports {ddr0_axi1_rid[*]}]
set_input_delay -clock axi_clk -min 4.155 [get_ports {ddr0_axi1_rid[*]}]
set_input_delay -clock axi_clk -max 8.310 [get_ports {ddr0_axi1_rlast}]
set_input_delay -clock axi_clk -min 4.155 [get_ports {ddr0_axi1_rlast}]
set_input_delay -clock axi_clk -max 8.310 [get_ports {ddr0_axi1_rresp[*]}]
set_input_delay -clock axi_clk -min 4.155 [get_ports {ddr0_axi1_rresp[*]}]
set_input_delay -clock axi_clk -max 8.310 [get_ports {ddr0_axi1_rvalid}]
set_input_delay -clock axi_clk -min 4.155 [get_ports {ddr0_axi1_rvalid}]
set_input_delay -clock axi_clk -max 8.310 [get_ports {ddr0_axi1_wready}]
set_input_delay -clock axi_clk -min 4.155 [get_ports {ddr0_axi1_wready}]
